{"name":"N\nC","email":"aureliencavallo@gmail.com","phone":"929 299 6237","links":"LinkedIn\nWebsite","skills":"Integrated Marketing\nDigital Marketing\nMulti Channel Marketing\nSales Strategy\nTrade Marketing\nSport Marketing\nSocial Media Marketing\nMarketing Plan\nBusiness Plan\nInternational Marketing\nGlobal Marketing\nMicrosoft PowerPoint\nMicrosoft Excel\nMicrosoft Office Word","languages":"English\nFrench\nSpanish; Castilian\nItalian\nEmployment History\nMarketing & Sales Strategy Executive, Longchamp, Paris, FR\nN OV E M B E R 2 0 1 8 — J A N U A RY 2 0 2 1\n- Coordinate and execute store's marketing strategy.\n- Plan sales strategy with the corporate team\n- Develop customer's loyalty program and CRM. Work on SalesForce\nand Cegid\n- Manage digital communication (emails, social medias, Whatsapp).\n- Write reports with Power Point, Excel and Word.\n- Adapt marketing and sales strategy with worldwide customers by communicating\non unique product features in English, Spanish and Italian.\n93% of monthly target reached on average from 2018 until COVID pandemic.\nSales Executive - Student Job, Balmain, Gucci, Louboutin, Balenciaga, Paris,\nFR\nN OV E M B E R 2 0 1 7 — N OV E M B E R 2 0 1 8\nInterim missions.\n- Improve sales strategy among the store.\n- Reach monthly targets fixed by the company in term of turnover, number of sales\nper customer, number of transformation (from prospect to purchase).\n- Administrate CRM, sales, customer database and inventories with softwares such\nas SalesForce or Cegid.\n- Present and explain to customers all the unique features of the different ranges\nof products.","education":"Master in Marketing, Baruch College - CUNY, New York City\nJ A N U A RY 2 0 2 1 — D E C E M B E R 2 0 2 2\nGraduated from the International Program with a GPA of 3.7 on all courses and 4\nfor marketing courses.\n5th year of university\nMasterin International Marketing, ESGCI group ofParis School ofBusiness,\nParis, FR\nO C TO B E R 2 0 1 9 — D E C E M B E R 2 0 2 1\nGraduated with a grade of 15/20 for all courses and 17/20 for marketing courses.\nEquiv 3.8 of GPA.\n4th year of college\nBachelor in economy, Université Denis Diderot (Paris VII), Paris, FR\nS E P T E M B E R 2 0 1 6 — M AY 2 0 1 9\nGraduated with honours with GPA of 3.5\nWinner of Inkiz : ESGCI Business Game 2020, Paris, FR\nJ U LY 2 0 2 0 — J U LY 2 0 2 0\nDigital Game of Entrepreneurship Management Simulation. You are a company of\ntattoo supplies and to win the contest you must have the best ROI. Be dominant in\nterm of market shares and have the best employees happy at work."}